In [ ]:
"""Find titles and descriptions for all movies catogorized as Action films"""

In [ ]:
"""SQL table creation and data insertion"""
drop table if exists   film ;
drop table if exists  category  ; 
drop table if exists  film_category  ; 
CREATE TABLE IF NOT EXISTS film (
  film_id smallint(5)  NOT NULL DEFAULT '0',
  title varchar(255) NOT NULL,
  description text,
  PRIMARY KEY (film_id));
CREATE TABLE category  (
   category_id  tinyint(3)  NOT NULL ,
   name  varchar(25) NOT NULL, `last_update` timestamp,
  PRIMARY KEY ( category_id ));
CREATE TABLE film_category  (
   film_id  smallint(5)  NOT NULL,
   category_id  tinyint(3)  NOT NULL, `last_update` timestamp);
INSERT INTO film VALUES(1,'ACADEMY DINOSAUR','A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies');
INSERT INTO film VALUES(2,'ACE GOLDFINGER','A Astounding Epistle of a Database Administrator And a Explorer who must Find a Car in Ancient China');
INSERT INTO film VALUES(3,'ADAPTATION HOLES','A Astounding Reflection of a Lumberjack And a Car who must Sink a Lumberjack in A Baloon Factory');

INSERT INTO category VALUES(1,'Action','2006-02-14 20:46:27');
INSERT INTO category VALUES(2,'Animation','2006-02-14 20:46:27');
INSERT INTO category VALUES(3,'Children','2006-02-14 20:46:27');
INSERT INTO category VALUES(4,'Classics','2006-02-14 20:46:27');
INSERT INTO category VALUES(5,'Comedy','2006-02-14 20:46:27');
INSERT INTO category VALUES(6,'Documentary','2006-02-14 20:46:27');

INSERT INTO film_category VALUES(1,1,'2006-02-14 21:07:09');
INSERT INTO film_category VALUES(2,1,'2006-02-14 21:07:09');
INSERT INTO film_category VALUES(3,6,'2006-02-14 21:07:09');

In [ ]:
"""SQL solution"""
# 1
SELECT title, description
FROM film
WHERE film_id IN
(SELECT film_id
FROM film_category
WHERE category_id = (SELECT category_id FROM category WHERE name = 'Action'))

# 2
SELECT f.title, f.description
FROM film AS f
INNER JOIN film_category AS fc
ON f.film_id = fc.film_id
WHERE fc.category_id = (SELECT category_id FROM category WHERE name = 'Action')

In [4]:
"""pandas dataframe creation"""
import numpy as np
import pandas as pd

tf = np.array([[1,'ACADEMY DINOSAUR','A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies'],
               [2,'ACE GOLDFINGER','A Astounding Epistle of a Database Administrator And a Explorer who must Find a Car in Ancient China'],
               [3,'ADAPTATION HOLES','A Astounding Reflection of a Lumberjack And a Car who must Sink a Lumberjack in A Baloon Factory']])
tc = np.array([[1,'Action','2006-02-14 20:46:27'],
               [2,'Animation','2006-02-14 20:46:27'],
               [3,'Children','2006-02-14 20:46:27'],
               [4,'Classics','2006-02-14 20:46:27'],
               [5,'Comedy','2006-02-14 20:46:27'],
               [6,'Documentary','2006-02-14 20:46:27']])
tfc = np.array([[1,1,'2006-02-14 21:07:09'],
                [2,1,'2006-02-14 21:07:09'],
                [3,6,'2006-02-14 21:07:09']])
film = pd.DataFrame(data=tf, columns=['film_id', 'title', 'description'])
print(film.dtypes)
category = pd.DataFrame(data=tc, columns=['category_id', 'name', 'last_update'])
print(category.dtypes)
film_category = pd.DataFrame(data=tfc, columns=['film_id', 'category_id', 'last_update'])
print(film_category.dtypes)
film.head()

film_id        object
title          object
description    object
dtype: object
category_id    object
name           object
last_update    object
dtype: object
film_id        object
category_id    object
last_update    object
dtype: object

  film_id             title                                        description
0       1  ACADEMY DINOSAUR  A Epic Drama of a Feminist And a Mad Scientist...
1       2    ACE GOLDFINGER  A Astounding Epistle of a Database Administrat...
2       3  ADAPTATION HOLES  A Astounding Reflection of a Lumberjack And a ...

In [2]:
category.head()

  category_id       name          last_update
0           1     Action  2006-02-14 20:46:27
1           2  Animation  2006-02-14 20:46:27
2           3   Children  2006-02-14 20:46:27
3           4   Classics  2006-02-14 20:46:27
4           5     Comedy  2006-02-14 20:46:27

In [5]:
film_category.head()

  film_id category_id          last_update
0       1           1  2006-02-14 21:07:09
1       2           1  2006-02-14 21:07:09
2       3           6  2006-02-14 21:07:09

In [11]:
df = pd.merge(film, film_category[['film_id', 'category_id']], on='film_id', how='inner')
df = pd.merge(df, category[['category_id', 'name']], on='category_id', how='inner')
df[df['name'] == 'Action'][['title', 'description']]

              title                                        description
0  ACADEMY DINOSAUR  A Epic Drama of a Feminist And a Mad Scientist...
1    ACE GOLDFINGER  A Astounding Epistle of a Database Administrat...